{
  "id": "ultracamp",
  "project": "Ultracamp",
  "name": "",
  "date": "June 2025",
  "cardTitle": "Ultracamp",
  "cardTags": ["WEB DESIGN", "LANDING", "RESPONSIVE"],
  "heroDescription": "Ultracamp is an adaptive online coding bootcamp platform offering flexible, AI-tutored programming education available 24/7. I designed the landing page to communicate its practical, modern and accessible learning model.",
  "heroImage": "/images/projects/ultracamp/Ultracamp01.webp",
  "overview": {
    "description": "The Ultracamp landing page presents the key benefits of learning to code through their full‑stack bootcamp. It highlights features like AI-enabled instant feedback, real‑world coding challenges, flexible pacing, and mentorship—encouraging visitors to enroll with clarity and confidence."
  },
  "projectGoal": {
    "description": "The objective was to craft a high‑conversion landing page that clearly communicates Ultracamp’s unique value proposition: a practical, self‑paced coding education supported by AI feedback and real‑world projects, in an engaging and trustworthy visual design."
  },
  "fontAndColours": {
    "description": "The visual style focuses on clarity and energy. Bright accent colors highlight key messages, while a clean neutral base supports readability. Typography is modern and legible across devices.",
    "colors": [
      "#3DAA89",
      "#286D58",
      "#0BF082",
      "#0F1110"
    ],
    "fonts": [
      {
        "name": "Inter Light"
      },
      {
        "name": "Inter Regular"
      },
      {
        "name": "Inter Medium"
      },
      {
        "name": "Inter Bold"
      }
    ]
  },
  "designProcess": {
    "description": "The design process followed the Design Thinking approach. It began with a thorough benchmarking of competitor landing pages in the online education and tech bootcamp space. From there, I structured the UX to prioritise clarity, trust and conversion. This was followed by wireframing, creation of a visual UI kit, and the final high-fidelity design and interaction prototypes.",
    "roadmap": {
      "description": "Initial project planning and timeline definition, establishing key milestones and deliverables for the Ultracamp landing page design process.",
      "image": ""
    },
    "definition": {
      "description": "",
      "image": ""
    },
    "inspiration": {
      "description": "",
      "image": ""
    },
    "ideation": {
      "description": "",
      "image": ""
    },
    "visualUi": {
      "description": "",
      "image": ""
    },
    "implementation": {
      "description": "",
      "image": ""
    }
  },
  "gallery": {
    "description": "Final mockups of the landing page showcasing key sections such as the hero banner, program introduction, platform benefits, calls to action, and visual identity elements—focused on clarity, user engagement, and conversion.",
    "images": [
      "/images/projects/ultracamp/Ultracamp02.webp",
      "/images/projects/ultracamp/Ultracamp03.webp",
      "/images/projects/ultracamp/Ultracamp04.webp",
      "/images/projects/ultracamp/Ultracamp05.webp"
    ]
  }
}